#include "pch.h"
#include "Guide.h"


void Guide::guide(Window window1)//输入规则介绍说明书
{
	system("cls");
	cout << "使用说明：" << endl;
	cout << "输入算式时，请按照下列规则输入：" << endl;
	cout << "1.四则运算+加 -减 *乘 /除按常规输入，负号用下划线(_)代替，注意将其与减号区别；可用括号()界定优先级" << endl;
	cout << "2.^幂:幂运算如下乘方输入x^y(x的y次方)如23^6就是23的6次方；开方也这样输入如81^(1/4)[或者81^0.25]表示81开4次方" << endl;
	cout << "3.!阶乘:6!表示1*2*3*4*5*6；(1+3)!表示4的阶乘，结果是24；1+3!表示1再加上3做阶乘的结果，是7" << endl;
	cout << "4.pi代表圆周率，即3.1415926536，本计算器利用弧度进行三角函数计算；计算正弦请输入sin，余弦输入cos，正切输入tan；sin(pi/2)就是二分之π弧度对应的正弦值（注意一定要打括号）其他依此类推；" << endl;
	cout << "5.计算以10为底的对数请输入log，如log1000=3，计算以e（2.718281828）为底的自然对数请输入ln，如lne^4=4,注意指数的输入要规范，如lne^4=4，但是(lne)^4=1，计算算式的对数要在对数符号后面把算式括起来，如ln(3+6*9)，计算以其他数为底的对数可利用对数换底公式，如以2为底，16的对数可输入ln16/ln2或者log16/log2结果都是4" << endl;
	cout << "6.可直接输入e和pi做数值计算" << endl;
	cout << "7.本计算器的括号只有小括号();不接受中括号[ ]和大括号{ },且算式一定要以等号（=）结束" << endl;
	cout << "8.支持多级括号运算" << endl;
	system("pause");
	system("cls");
	window1.windowMain();
}
